**Terraform Plan**:
```Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.acm_expiry_alarms["CertificateExpiry30Days"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "acm_expiry_alarms" {
      ~ dimensions                            = {
          + "CertificateArn" = "arn:aws:acm:eu-west-2:448049830832:certificate/04553463-0c3a-4168-bcf2-90388d0d2004"
        }
        id                                    = "ACM-CertificateExpiry30Days"
        tags                                  = {
            "AlertType"   = "security"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Service"     = "acm"
            "Severity"    = "high"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.acm_expiry_alarms["CertificateExpiry44Days"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "acm_expiry_alarms" {
      ~ dimensions                            = {
          + "CertificateArn" = "arn:aws:acm:eu-west-2:448049830832:certificate/04553463-0c3a-4168-bcf2-90388d0d2004"
        }
        id                                    = "ACM-CertificateExpiry44Days"
        tags                                  = {
            "AlertType"   = "security"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Service"     = "acm"
            "Severity"    = "warning"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.acm_expiry_alarms["CertificateExpiry7Days"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "acm_expiry_alarms" {
      ~ dimensions                            = {
          + "CertificateArn" = "arn:aws:acm:eu-west-2:448049830832:certificate/04553463-0c3a-4168-bcf2-90388d0d2004"
        }
        id                                    = "ACM-CertificateExpiry7Days"
        tags                                  = {
            "AlertType"   = "security"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Service"     = "acm"
            "Severity"    = "critical"
        }
        # (21 unchanged attributes hidden)
    }

  # module.eligibility_signposting_lambda_function.aws_lambda_function.eligibility_signposting_lambda will be updated in-place
  ~ resource "aws_lambda_function" "eligibility_signposting_lambda" {
        id                             = "eligibility_signposting_api"
      ~ last_modified                  = "2025-11-05T17:00:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:448049830832:function:eligibility_signposting_api:232" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:448049830832:function:eligibility_signposting_api:232/invocations" -> (known after apply)
      ~ source_code_hash               = "crv9YuFTXPN/MLAUSyuWm7tNUjUl2OwUXlHbI+5SfM4=" -> "DdOaJ6moRL0z86tkZW3vx+GyMbZJHrlZcMklbQ1H0fs="
        tags                           = {}
      ~ version                        = "232" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eligibility_status_table.aws_dynamodb_table.dynamodb_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dynamodb_table" {
        id                          = "eligibility-signposting-api-dev-eligibility_datastore"
        name                        = "eligibility-signposting-api-dev-eligibility_datastore"
        tags                        = {
            "ApplicationRole"     = "API"
            "CostCentre"          = "129117"
            "Customer"            = "NHS England"
            "DataType"            = "PII"
            "Environment"         = "dev"
            "FinOpsTagVersion"    = "1"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "edd.almond1@nhs.net"
            "Product"             = "EligibilitySignpostingAPI"
            "Programme"           = "Vaccinations"
            "ProjectType"         = "Production"
            "PublicFacing"        = "Y"
            "ServiceCategory"     = "Silver"
            "Stack"               = "api-layer"
            "Tool"                = "Terraform"
            "data_classification" = "5"
            "workspace"           = "default"
        }
        # (13 unchanged attributes hidden)

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:eu-west-2:448049830832:key/1f42fe69-c28e-4edb-ad03-af06908fb200"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```